{
  "plugins": {
    "auto-pairs": {
      "src": "https://github.com/LunarWatcher/auto-pairs"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "copilot.vim": {
      "src": "https://github.com/github/copilot.vim"
    },
    "crates.nvim": {
      "src": "https://github.com/saecki/crates.nvim",
      "version": "'stable'"
    },
    "diffview.nvim": {
      "src": "https://github.com/dlyongemallo/diffview.nvim"
    },
    "editorconfig-vim": {
      "src": "https://github.com/editorconfig/editorconfig-vim"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "goto-preview": {
      "src": "https://github.com/rmagatti/goto-preview"
    },
    "gruvbox-material": {
      "src": "https://github.com/sainnhe/gruvbox-material"
    },
    "guess-indent.nvim": {
      "src": "https://github.com/nmac427/guess-indent.nvim"
    },
    "leap.nvim": {
      "src": "https://codeberg.org/andyg/leap.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "messenger.nvim": {
      "src": "https://github.com/lsig/messenger.nvim"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "opencode.nvim": {
      "src": "https://github.com/NickvanDyke/opencode.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim",
      "version": "9.0.0 - 10.0.0"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "swap-buffers.nvim": {
      "src": "https://github.com/caenrique/swap-buffers.nvim"
    },
    "vim-illuminate": {
      "src": "https://github.com/rrethy/vim-illuminate"
    },
    "vim-polyglot": {
      "src": "https://github.com/sheerun/vim-polyglot"
    },
    "vim-visual-multi": {
      "src": "https://github.com/mg979/vim-visual-multi"
    }
  }
}
